app/controllers/snippets_controller.rb

    def index
    @snippets = Snippet.all
---
SELECT `snippets`.* FROM `snippets`

  def show
    @snippet = Snippet.find(params[:id])
---
SELECT `snippets`.* FROM `snippets` WHERE `snippets`.`id` = 1 LIMIT 1

  def create
    @snippet = Snippet.new(params[:snippet])
    if @snippet.save
---
INSERT INTO `snippets` (`created_at`, `language_id`, `source_code`, `updated_at`) VALUES ('2013-02-25 18:35:39', 1, 'sdkfn\r\n', '2013-02-25 18:35:39')

  def destroy
    @snippet = Snippet.find(params[:id])
    @snippet.destroy
---
SELECT `snippets`.* FROM `snippets` WHERE `snippets`.`id` = 3 LIMIT 1
DELETE FROM `snippets` WHERE `snippets`.`id` = 3